[
  {
    "id": "event.intro",
    "title": "A New Begining...",
    "description": "...Chancellor? Can you hear me? Good.\n I must apologize for the abruptness, but there is no time for celebration. A Billion eyes turned toward you—some in hope, some in fear. The burdens of our civilization rest upon your shoulders now, whether you are ready or not.\nThe reports are piling in already economic projections, military assessments, diplomatic briefings. You will make your first decisions soon, and they will set the tone for all that follows. Some will expect strength. Others, wisdom. But all will expect something.\nThe empire is not a well-oiled machine, ticking along in perfect harmony. No, Chancellor. It is a weak beast, small and wounded, held together by duty, ambition, and the sheer force of will of those who came before you.\nYou are no longer merely a person. You are an institution. A symbol. And in the coming days, you will learn what that truly means.\nThe question is, will we be able to adapt fast enough for the universe, and whatever it holds in store for us?",
    "options": [
      {
        "id": "option_hostile",
        "text": "We'll take the stars!",
        "effects": [
          {
            "type": "addAlloy",
            "value": 250
          }
        ],
        "nextEvent": "event.peace_response"
      },
      {
        "id": "option_neutral",
        "text": "We'll tread lightly.",
        "effects": [
          {
            "type": "addConsumer",
            "value": 500
          }
        ]
      },
      {
        "id": "option_peace",
        "text": "We'll great whatever comes our way.",
        "effects": [
          {
            "type": "addMetal",
            "value": 500
          }
        ]
      }
    ]
  },
  {
    "id": "event.glorious_unification",
    "title": "The End of Nations",
    "description": "Chancellor, I wanted you to be the first to know—the last nations of our homeworld have dissolved their borders.\nThere was no war, no bloodshed. No treaties forced under duress. Simply an understanding acknowledgment that in this era, in this age of interstellar ambition, we can no longer afford to be divided by old lines drawn in the dirt.\nWe have become something more than separate peoples with separate flags. And so today, for the first time in history, our species speaks with a single voice.\nWhen historians look back on this day, they will see it not as an end, but as the beginning of something greater",
    "options": [
      {
        "id": "option_continue",
        "text": "We're on the same side at last",
        "conditions": [
          {
            "type": "hasFleetPower",
            "min": 1000
          }
        ],
        "effects": [
          {
            "type": "addUnity",
            "value": 500
          }
        ]
      }
    ]
  },
  {
    "id": "event.glorious_unification",
    "title": "The End of Nations",
    "description": "We may have found the holy grail of materials science.\nThe new alloy synthesized on our homeworld is stronger than steel, lighter than aerogel, and it shines with a natural iridescence, shifting between deep blues and golds. The researchers swear it wasn't engineered for beauty—it simply turned out this way.\nWe have run the numbers. Mass production would be trivial. Every hull, every structure, every piece of equipment in our empire could be replaced within a few years, and from now on, manufactured with this material although it's more expensive then what we would replace with it, might just be worth it.",
    "options": [
      {
        "id": "option_continue",
        "text": "Ramp up production, replace everything we can with it!",
        "effects": [
          {
            "type": "addUnity",
            "value": 500
          }
        ]
      }
    ]
  }
]